Revit 2027 API
ScheduleFieldMultipleValuesDisplayType Enumeration
 Define how the schedule field's multiple value is displayed.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum ScheduleFieldMultipleValuesDisplayType
Public Enumeration ScheduleFieldMultipleValuesDisplayType
public enum class ScheduleFieldMultipleValuesDisplayType
type ScheduleFieldMultipleValuesDisplayType
Members
Member name | Value | Description
Custom | 2 |  Display custom text per ScheduleField instance, as defined by the [!:Autodesk::Revit::DB::ScheduleField::MultipleValuesCustomText] property.
Project | 0 |  Display the project setting [!:Autodesk::Revit::DB::MultipleValuesIndicationSettings::Value].
Varies | 1 |  Display a standard hardcoded text, translated for the active locale.
See Also
Reference
Autodesk.Revit.DB Namespace